In [ ]:
import pandas as pd
import numpy as np

In [ ]:
x=['a','d','b','c',1,2,3]
s=pd.Series(x,index=['A','B','C','D','E','F','G'])
s

In [ ]:
import numpy as np
arr=np.array(['p','b','h','u'])
s1=pd.Series(arr)
s1

In [ ]:
d={'name':'a','age':23,'class':4,'bloodgroup':'B'}
s2=pd.Series(d)
s2

In [ ]:
d['class']

In [ ]:
d={'name':'arun','surname':'singh','age':23,'class':4,'bloodgroup':'B'}
s2=pd.Series(d,index=['name','surname'])
s2

In [ ]:
x=['a','d','b','c',1,2,3]
s=pd.DataFrame(x,index=['A','B','C','D','E','F','G'])
s

In [ ]:
x=['a','d','b','c',1,2,3]
s=pd.Series(x,index=['A','B','C','D','E','F','G'])
s

In [ ]:
s1=pd.Series(10,index=['A','B','C','D','E','F','G','H','I','J'])
s1

In [ ]:
s1.shape

In [ ]:
s1.dtype

In [ ]:
s1.index

In [ ]:
s1.values

In [ ]:
s1.size

In [ ]:
s1.empty

In [ ]:
s1.hasnans #check nan value

In [ ]:
s1.ndim

In [ ]:
#s1.itemsize -check

In [ ]:
x=['a','d','b']
s=pd.Series(x,index=['A','B','C'])
s

In [ ]:
s.map({'a':'A','b':'g'})

In [ ]:
s

In [ ]:
x=['a','d','b']
s=pd.Series(x,name='column1')
s

In [ ]:
s.to_frame()

In [ ]:
x=['a','d','b','b']
s=pd.Series(x)
s

In [ ]:
s.value_counts()

In [ ]:
x=['a','d','b']
s=pd.DataFrame(x)
s

In [ ]:
d={'name':['a','b','c'],
  'age':[23,333,45],
  'salary':[1400,4500,3400]}
df=pd.DataFrame(d)
df

In [ ]:
d1={'name':pd.Series(['x','y','z','i'],index=['i1','i2','i3','i4']),
  'age':pd.Series([23,333,45],index=['i1','i2','i3']),
  'salary':pd.Series([1400,4500,3400],index=['i1','i2','i3'])}
df1=pd.DataFrame(d1)
df1

In [ ]:
arr1=np.array([['p','b','h','u'],[1,2,3,4],['p','b','h','u'],[1,2,3,4]])
s2=pd.DataFrame(arr1,columns=['i1','i2','i3','i4'])
s2

In [ ]:
arr3=np.array([[11,'Rahul',200],[12,'Raj',300],[13,'Ramesh',200]])
s3=pd.DataFrame(arr3,columns=['emp_id','name','salary'])
s3

In [ ]:
s3['experience']=pd.Series([3,4,5]) #add new column

In [ ]:
s3

In [ ]:
dnew={'salary':int}

In [ ]:
s3=s3.astype(dnew)

In [ ]:
s3['salary'].dtype

In [ ]:
s3['xyz']=s3['salary']+s3['experience']
s3

In [ ]:
del s3["inference"]

In [ ]:
s3['emp_id']

In [ ]:
s3

In [ ]:
s3.pop('xyz')

In [ ]:
s3

In [ ]:
s3.loc[1]

In [ ]:
s3.loc[[1,2]]

In [ ]:
s3[1:4:2]

In [ ]:
nn=pd.DataFrame([[14,'Ajay',200,6],[15,'Rachel',500,9],[16,'Olive',600,8]],columns=['emp_id','name','salary','experience'])
dfnew=s3.append(nn,ignore_index=True)
dfnew

In [ ]:
dfnew[1:6:2]

In [ ]:
dfnew.drop(2)

In [ ]:
import pandas as pd
df=pd.read_csv("weather.csv")
df

In [ ]:
d1={'Date':['01-12-2022','02-12-2022','03-12-2022','04-12-2022','05-12-2022'],
  'Temperature':[33,45,34,56,44],
  'Humidty':[5,6,7,8,8],
   'Weather':['Rain','Snow','Sun','Windy','Snow']}
df1=pd.DataFrame(d1)
df1

In [ ]:
df1.head(2)

In [ ]:
df1.columns

In [ ]:
df1.Humidty

In [ ]:
df1['Humidty']

In [ ]:
df1[['Humidty','Temperature']]

In [ ]:
df1.Temperature.max()

In [ ]:
df.describe()

In [ ]:
df[df.Humidty>5]

In [ ]:
df[df.Temperature ==df.Temperature.min()]

In [ ]:
df[df.Temperature ==df.Temperature.min()][['Date']] #want date of min temeparrure

In [ ]:
df[df.Temperature ==df.Temperature.min()][['Date','Temperature']]

In [ ]:
df1.index

In [ ]:
dfnew=df.set_index('Date') #toset index by column
dfnew  #if you want to change original use iplace=True

In [ ]:
dfnew.loc['02-12-2022':'04-12-2022']

In [ ]:
dfnew.reset_index(inplace=True)
dfnew

In [ ]:
dfnew.to_excel("weather.xlsx")

In [ ]:
pip install pandas_profiling

In [ ]:
import pandas_profiling as prof

In [ ]:
p=prof.ProfileReport(df)

In [ ]:
p.to_file("ProfileReport.html")

In [ ]:
p

In [ ]:
df2=pd.read_csv('weathernew.csv')
df2

In [ ]:
df4=df2.fillna(0)
df4

In [ ]:
df4.info()

In [ ]:
df5=df2.fillna({"Temperature":0,'Humidty':0.0,'Weather':'No Weather'})
df5

In [ ]:
#forward filling
df2

In [ ]:
df6=df2.fillna(method='ffill',axis=1)

In [ ]:
df6

In [ ]:
df7=df2.fillna(method='bfill') #backward filling
df7

In [ ]:
#fill nan value
df8=df2.interpolate()

In [ ]:
df8

In [ ]:
df2.dropna()

In [ ]:
df2.isna()

In [ ]:
df2.isnull()

In [ ]:
df2.notna()

In [ ]:
df2.dropna(how='any')

In [ ]:
df10=pd.read_excel("weatherg.xlsx",sheet_name='weathernew')
df10

In [ ]:
import numpy as np
df11=df10.replace([-9999,np.nan])
df11

In [ ]:
df11=df10.replace([-9999,-1000],np.nan)
df11

In [ ]:
df12=df10.replace({'Temperature':[-9999],'Humidty':[-1000],'Weather':'Nothing'},np.nan)
df12

In [ ]:
df13=df12.replace({-9999:np.nan,'Snow':'HELLO'})
df13

In [ ]:
df15=pd.read_excel("weatherg.xlsx",sheet_name='Sheet3')
df15

In [ ]:
df16=df15.replace({'Temperature':'[A-Za-z]','Humidty':'[A-Za-z]'},'',regex=True)

In [ ]:
df16

In [ ]:
a=list(df16.Weather.unique())

In [ ]:
a

In [ ]:
df16.replace(a,range(4))

In [ ]:
df16.replace(['Nothing', 'Sun ', 'Snow', 'Windy'],[0,1,2,3])

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df1=pd.read_excel("weatherg.xlsx",sheet_name='New')
df1

In [ ]:
df1.rename(columns={'Date':'NewDate'},inplace=True)
df1

In [ ]:
df1.rename(columns={'NewDate':'MyDate','Temperature':'Temp'},inplace=True) #renaming columns
df1

In [ ]:
df1.columns=['Date','City','Temperature','Windspeed','Climate'] #renaming columns
df1

In [ ]:
df1.City.unique()

In [ ]:
mygroup=df1.groupby('City')
mygroup

In [ ]:
for i,j in mygroup:
    print(i)
    print(j)

In [ ]:
mygroup.get_group("Delhi ")

In [ ]:
mygroup.first() #prints first entry from each group

In [ ]:
mygroup1=df1.groupby(['City','Climate'])
mygroup1

In [ ]:
mygroup1.first()

In [ ]:
mygroup.max()

In [ ]:
mygroup.min()

In [ ]:
mygroup.mean()

In [ ]:
mygroup.describe()

In [ ]:
import matplotlib.pyplot as plt

In [ ]:
mygroup.plot()

## GroupBy

In [ ]:
import pandas as pd, numpy as np

In [ ]:
dic={'A':['x','x','y','y','a'] , 'B': ['p','s','p','s','p'], 'C':[11,2,5,3,4] , 'D':[11,2,5,3,4]}

x= [['first', 'first','second','third', 'third'] , ['car','car','motor','motor','car']]
df=pd.DataFrame(dic)
df

In [ ]:
index_=pd.MultiIndex.from_arrays(x,names=['Rank','Vehicle'])
index_

In [ ]:
df2=pd.DataFrame({'M':['x','x','y','y','a'],'N':[11,2,5,3,4]})
df2

In [ ]:
df2.groupby("M")["N"].sum()

In [ ]:
df2.groupby("M")["N"].mean()

In [ ]:
df2.groupby(['M']).sum()

In [ ]:
df2.groupby(['M'],sort=False).sum()

In [ ]:
df2.groupby(['M'],sort=True).sum()

In [ ]:
#.group to get all groups
g=df2.groupby(['M'])
g.groups

In [ ]:
g.get_group("x")

In [ ]:
g.get_group("x").sum()

In [ ]:
g.get_group("x")['N'].sum()

In [ ]:
df

In [ ]:
df.index=index_
df

In [ ]:
g1=df.groupby(['Rank','Vehicle'])

In [ ]:
g1.groups

In [ ]:
g1.get_group(('first', 'car'))

In [ ]:
g2=df.groupby(['A','B'])

In [ ]:
g2.groups

In [ ]:
h=dict(g2.groups)
type(h)

In [ ]:
j=dict(g2.groups)
j.keys()

In [ ]:
for i,j in g2:
    print(i)
    print(j)

In [ ]:
g3=df['C'].groupby(level=0)

In [ ]:
g3.groups

In [ ]:
g3.sum()

In [ ]:
df

In [ ]:
g4=df['C'].groupby(level=1)

In [ ]:
g4.sum()

In [ ]:
df['C'].groupby(level=['Rank','Vehicle']).sum()

In [ ]:
df['C'].groupby(level=['Rank','Vehicle']).mean()

In [ ]:
g5=df.groupby([pd.Grouper(level=0),'A'])

In [ ]:
g5.groups

In [ ]:
g5.sum()

In [ ]:
h1=df.groupby(['Rank','A'])

In [ ]:
h1.sum()

In [ ]:
g5=df.groupby("Rank")
g5.groups

In [ ]:
g5['C'].sum()

In [ ]:
g5['C'].mean()

In [ ]:
df1=df.reset_index()

In [ ]:
df1

In [ ]:
df1.set_index(["Rank",'Vehicle'])

In [ ]:
d={'Animals':['Cat','Cat','Dog','Dog','Rat'],'Rank':['a','b','a','a','b'],'N':[11,2,3,4,5],'Rate':[10,12,8,9,3]}
dff=pd.DataFrame(d)
dff

In [ ]:
g7_=dff.groupby('Animals')
g7_.groups

In [ ]:
g7_.sum()

In [ ]:
g7_.mean()

In [ ]:
g7_.aggregate(np.sum)

In [ ]:
g7_.agg(np.sum)

In [ ]:
g8=dff.groupby(['Animals','Rank'])

In [ ]:
g8.agg(np.sum)

In [ ]:
g9=dff.groupby('Animals',as_index=False)
g9.groups

In [ ]:
g7.size()

In [ ]:
g8.describe()

In [ ]:
g8['Rate'].agg([np.sum,np.mean,np.std])

In [ ]:
g8['Rate'].agg([np.sum,np.mean,np.std]).rename(columns={'sum':'Total','mean':'Average'})

 # Pandas New Lecture

In [ ]:
import pandas as pd, numpy as np
d={'Animals':['Cat','Cat','Dog','Dog','Rat'],'Rank':['a','b','a','a','b'],'N':[11,2,3,4,5],'Rate':[10,12,8,9,3]}
dff=pd.DataFrame(d)
dff

In [ ]:
g3=dff["Rate"].groupby(dff['Animals'])

In [ ]:
list(g3)

In [ ]:
g4=dff["Rate"].groupby([dff['Animals'],dff['Rank']])

In [ ]:
list(g4)

In [ ]:
dff["N"].groupby([dff['Animals'],dff['Rank']]).mean()

In [ ]:
import math

In [ ]:
list(g3)

In [ ]:
np.log2(10)

In [ ]:
dff.groupby('Animals').apply(lambda y: np.log2(y['Rate']))

In [ ]:
dff.groupby('Animals').apply(lambda y: np.mean(np.log2(y['Rate'])))

In [ ]:
(3.321928+3.584963)/2

In [ ]:
dff.groupby('Animals').apply(lambda y: np.max(np.log2(y['Rate'])))

In [ ]:
df = pd.DataFrame({'cat': ['A', 'A', 'A', 'B', 'B', 'B', 'B'],
                   'pf': [18, 22, 19, 14, 11, 20, 28],
                   'pt': [14, 21, 19, 14, 12, 20, 21]})
df

In [ ]:
df.groupby("cat").apply(lambda x:np.max(x['pf']))

In [ ]:
df.groupby("cat").apply(lambda x:(x['pf'].max()))

In [ ]:
df.groupby("cat").apply(lambda x:(x['pf']-x['pt'])*10)

In [ ]:
df.groupby("cat").apply(lambda x:(x['pf']-x['pt'])*10).mean()

In [ ]:
df.groupby("cat").agg(['sum','min','max'])

In [ ]:
df.groupby("cat").agg([np.sum,np.mean,np.std])

In [ ]:
df.groupby("cat").filter(lambda x:(len(x)<4))

In [ ]:
df1=pd.DataFrame({'City':['Mumbai','Delhi','Gurgaon'],'Temperature':[45,56,56],'Windspeed':[10,20,15]})
df2=pd.DataFrame({'City':['Mumbai','Jaipur','Goa'],'Temperature':[22,35,25],'Windspeed':[17,11,18]})
print(df1)
print(df2)

In [ ]:
x1=pd.concat([df1,df2])
x1

In [ ]:
y=[x1,df2,df1]

In [ ]:
pd.concat(y) #simply it is concatenating one below the other

In [ ]:
output=pd.concat(y,keys=['first','second','third'])
output

In [ ]:
output.loc["first":'second']

In [ ]:
df1=pd.DataFrame({'City':['Mumbai','Delhi','Gurgaon','Haryana'],'Temperature':[45,56,56,66],'Windspeed':[10,20,15,4]})
df2=pd.DataFrame({'City':['Mumbai','Jaipur','Goa'],'Temperature':[22,35,25],'Windspeed':[17,11,18]})
print(df1)
print(df2)

In [ ]:
y2=pd.concat([df1,df2],axis=1)
y2

In [ ]:
pd.concat([df1,df2],axis=1, join='inner')

In [ ]:
pd.concat([df1,df2], ignore_index=True)

In [ ]:
df_temp=pd.DataFrame({'City':['Mumbai','Delhi','Gurgaon'],'Temperature':[45,56,66]})
df_wind=pd.DataFrame({'City':['Mumbai','Jaipur','Goa'],'Windspeed':[17,11,18]})
print(df_temp)
print(df_wind)

In [ ]:
newvar=pd.concat([df_temp,df_wind], ignore_index=True)
newvar

In [ ]:
pd.concat([df_temp,df_wind], axis=1)

In [ ]:
a=pd.Series(['Rainy','Snow','Sunny'], name='weather')

In [ ]:
pd.concat([newvar,a], axis=1)

In [ ]:
pd.concat([newvar,a], ignore_index=True)

In [2]:
x1=pd.Series(['Rainy','Snow','Sunny'], name='weather')
x2=pd.Series(['Winter','Autumn','Summer'], name='Season')
x3=pd.Series(['North','South','East'], name='Region')

In [3]:
pd.concat([x1,x2,x3],axis=1)

  weather  Season Region
0   Rainy  Winter  North
1    Snow  Autumn  South
2   Sunny  Summer   East

In [4]:
pd.concat([x1,x2,x3],axis=1, keys=['a','b','c'])

       a       b      c
0  Rainy  Winter  North
1   Snow  Autumn  South
2  Sunny  Summer   East

In [1]:
import pandas as pd, numpy as np

In [5]:
x1.append([x2,x3])

0     Rainy
1      Snow
2     Sunny
0    Winter
1    Autumn
2    Summer
0     North
1     South
2      East
dtype: object

### Merge

In [25]:
import pandas as pd, numpy as np
df1=pd.DataFrame({'City':['Mumbai','Delhi','Gurgaon','Haryana'],'Temperature':[45,56,56,66]})
df2=pd.DataFrame({'City':['Mumbai','Delhi','Gurgaon','Haryana'],'Windspeed':[17,11,18,65]})
df1

      City  Temperature
0   Mumbai           45
1    Delhi           56
2  Gurgaon           56
3  Haryana           66

In [26]:
df2

      City  Windspeed
0   Mumbai         17
1    Delhi         11
2  Gurgaon         18
3  Haryana         65

In [17]:
import pandas as pd, numpy as np
df_1=pd.DataFrame({'City':['Mumbai','Delhi','Gurgaon','Haryana','Surat'],'Temperature':[45,56,56,66,38]})
df_2=pd.DataFrame({'City':['Mumbai','Delhi','Gurgaon','Haryana','Surat'],'Windspeed':[17,11,18,65,np.nan]})

In [27]:
df3=pd.merge(df1,df2, on='City',how = 'inner')
df3

      City  Temperature  Windspeed
0   Mumbai           45         17
1    Delhi           56         11
2  Gurgaon           56         18
3  Haryana           66         65

In [30]:
df6=pd.merge(df_1,df_2, on='City', how='outer')
df6

      City  Temperature  Windspeed
0   Mumbai           45       17.0
1    Delhi           56       11.0
2  Gurgaon           56       18.0
3  Haryana           66       65.0
4    Surat           38        NaN

In [32]:
pd.merge(df_1,df_2, on='City', how='right')

      City  Temperature  Windspeed
0   Mumbai           45       17.0
1    Delhi           56       11.0
2  Gurgaon           56       18.0
3  Haryana           66       65.0
4    Surat           38        NaN

In [35]:
df_1=pd.DataFrame({'City':['Mumbai','Delhi','Gurgaon','Haryana','Surat'],'Temperature':[45,56,56,66,66]})
df_2=pd.DataFrame({'City':['Chennai','Mumbai','Delhi','Gurgaon','Haryana'],'Windspeed':[17,11,18,65,66]})
print(df_1)
print(df_2)

      City  Temperature
0   Mumbai           45
1    Delhi           56
2  Gurgaon           56
3  Haryana           66
4    Surat           66
      City  Windspeed
0  Chennai         17
1   Mumbai         11
2    Delhi         18
3  Gurgaon         65
4  Haryana         66

In [36]:
df_new=pd.merge(df_1,df_2, on='City',how='right')
df_new

      City  Temperature  Windspeed
0  Chennai          NaN         17
1   Mumbai         45.0         11
2    Delhi         56.0         18
3  Gurgaon         56.0         65
4  Haryana         66.0         66

In [42]:
pd.merge(df_1,df_2, on='City',how='outer',indicator=True)

      City  Temperature  Windspeed      _merge
0   Mumbai         45.0       11.0        both
1    Delhi         56.0       18.0        both
2  Gurgaon         56.0       65.0        both
3  Haryana         66.0       66.0        both
4    Surat         66.0        NaN   left_only
5  Chennai          NaN       17.0  right_only

In [43]:
df_1_=pd.DataFrame({'City':['Mumbai','Delhi','Gurgaon','Haryana','Surat'],'Temperature':[45,56,56,66,66],"k":['k1','k2','k1','k2','k1']})
df_2_=pd.DataFrame({'City':['Chennai','Mumbai','Delhi','Gurgaon','Haryana'],'Windspeed':[17,11,18,65,66],"k":['k1','k1','k1','k1','k1']})
print(df_1_)
print(df_2_)

      City  Temperature   k
0   Mumbai           45  k1
1    Delhi           56  k2
2  Gurgaon           56  k1
3  Haryana           66  k2
4    Surat           66  k1
      City  Windspeed   k
0  Chennai         17  k1
1   Mumbai         11  k1
2    Delhi         18  k1
3  Gurgaon         65  k1
4  Haryana         66  k1

In [44]:
pd.merge(df_1_,df_2_, on=['k','City'], how='outer', indicator=True)  #outer through two keys

      City  Temperature   k  Windspeed      _merge
0   Mumbai         45.0  k1       11.0        both
1    Delhi         56.0  k2        NaN   left_only
2  Gurgaon         56.0  k1       65.0        both
3  Haryana         66.0  k2        NaN   left_only
4    Surat         66.0  k1        NaN   left_only
5  Chennai          NaN  k1       17.0  right_only
6    Delhi          NaN  k1       18.0  right_only
7  Haryana          NaN  k1       66.0  right_only

In [45]:
pd.merge(df_1_,df_2_, on=['k','City'], how='inner', indicator=True)

      City  Temperature   k  Windspeed _merge
0   Mumbai           45  k1         11   both
1  Gurgaon           56  k1         65   both

In [46]:
pd.merge(df_1_,df_2_, on=['k','City'], how='left', indicator=True)

      City  Temperature   k  Windspeed     _merge
0   Mumbai           45  k1       11.0       both
1    Delhi           56  k2        NaN  left_only
2  Gurgaon           56  k1       65.0       both
3  Haryana           66  k2        NaN  left_only
4    Surat           66  k1        NaN  left_only

In [47]:
pd.merge(df_1_,df_2_, on=['k','City'], how='right', indicator=True)

      City  Temperature   k  Windspeed      _merge
0  Chennai          NaN  k1         17  right_only
1   Mumbai         45.0  k1         11        both
2    Delhi          NaN  k1         18  right_only
3  Gurgaon         56.0  k1         65        both
4  Haryana          NaN  k1         66  right_only

In [48]:
df_4_=pd.DataFrame({'City':['Mumbai','Delhi','Gurgaon','Haryana','Surat'],'Temperature':[45,56,56,66,66]}, index=pd.Index(['k1','k2','k3','k4','k5'],name='key'))
df_5_=pd.DataFrame({'City':['Chennai','Mumbai','Delhi','Gurgaon','Haryana'],'Windspeed':[17,11,18,65,66]},index=pd.Index(['k3','k4','k5','k6','k7'],name='key'))
print(df_4_)
print(df_5_)

        City  Temperature
key
k1    Mumbai           45
k2     Delhi           56
k3   Gurgaon           56
k4   Haryana           66
k5     Surat           66
        City  Windspeed
key
k3   Chennai         17
k4    Mumbai         11
k5     Delhi         18
k6   Gurgaon         65
k7   Haryana         66

In [49]:
df_join=df_4_.join(df_5_, lsuffix='_left',rsuffix='_right')
df_join

    City_left  Temperature City_right  Windspeed
key
k1     Mumbai           45        NaN        NaN
k2      Delhi           56        NaN        NaN
k3    Gurgaon           56    Chennai       17.0
k4    Haryana           66     Mumbai       11.0
k5      Surat           66      Delhi       18.0

In [50]:
df_a=pd.DataFrame({'city':['Haryana','Delhi','Mumbai'],'windspeed':[67,87,67]})
df_b=pd.DataFrame({'temperature':[45,67,89],'population':[100,200,300]})
print(df_a)
print(df_b)

      city  windspeed
0  Haryana         67
1    Delhi         87
2   Mumbai         67
   temperature  population
0           45         100
1           67         200
2           89         300

In [51]:
df_a.join(df_b, how='outer')

      city  windspeed  temperature  population
0  Haryana         67           45         100
1    Delhi         87           67         200
2   Mumbai         67           89         300

In [52]:
df_a=pd.DataFrame({'city':['Haryana','Delhi','Mumbai'],'windspeed':[67,87,67]},index=pd.Index(['k0','k1','k2']))
df_b=pd.DataFrame({'temperature':['45f','67f','89f'],'population':[100,200,300]}, index=pd.Index(['k1','k2','k3']))
print(df_a)
print(df_b)

       city  windspeed
k0  Haryana         67
k1    Delhi         87
k2   Mumbai         67
   temperature  population
k1         45f         100
k2         67f         200
k3         89f         300

In [53]:
df_a.join(df_b)

       city  windspeed temperature  population
k0  Haryana         67         NaN         NaN
k1    Delhi         87         45f       100.0
k2   Mumbai         67         67f       200.0

In [54]:
df_a.join(df_b, how='outer')

       city  windspeed temperature  population
k0  Haryana       67.0         NaN         NaN
k1    Delhi       87.0         45f       100.0
k2   Mumbai       67.0         67f       200.0
k3      NaN        NaN         89f       300.0

In [55]:
df_a.join(df_b, how='inner')

      city  windspeed temperature  population
k1   Delhi         87         45f         100
k2  Mumbai         67         67f         200

In [56]:
df_a.join(df_b, how='right')

      city  windspeed temperature  population
k1   Delhi       87.0         45f         100
k2  Mumbai       67.0         67f         200
k3     NaN        NaN         89f         300

In [57]:
df_a.join(df_b, how='left')

       city  windspeed temperature  population
k0  Haryana         67         NaN         NaN
k1    Delhi         87         45f       100.0
k2   Mumbai         67         67f       200.0

In [58]:
df_b.join(df_a)

   temperature  population    city  windspeed
k1         45f         100   Delhi       87.0
k2         67f         200  Mumbai       67.0
k3         89f         300     NaN        NaN

In [59]:
df_a.join(df_b, on='city')

       city  windspeed temperature  population
k0  Haryana         67         NaN         NaN
k1    Delhi         87         NaN         NaN
k2   Mumbai         67         NaN         NaN